package utils

const DEBUG_STATEMENTS = false
const GRAPH_FULL = false
const TABLE_FULL = false

const (
	INFO = "" +
		"Лабораторная работа №6\n" +
		"Решение ОДУ\n" +
		"Подготовила Софья Сухарева\n" +
		"P32131, ISU:334641, вариант №18"
	CHOOSE_FUNC  = "Выберите функцию: "
	CHOOSE_INPUT = "" +
		"Выберите способ ввода: \"F\" (файл) или \"T\" (терминал)." +
		"\nF/T: "
	CHOOSE_OUTPUT = "" +
		"Выберите способ вывода: \"F\" (файл) или \"T\" (терминал)." +
		"\nF/T: "
	INPUT_ERR      = "Ошибка в ведённых данных. Проверьте корректность значения и повторите ввод: "
	INPUT_X0Y0     = "Введите начальные приближения X0, Y0 через пробел: "
	INPUT_INTERVAL = "Задайте границы интервала через пробел: "
	INPUT_STEP     = "Введите шаг: "
	INPUT_ACC      = "Задайте точность: "
)
